from typing import Any
from typing import Dict,AnyStr

district = {
  'চট্টগ্রাম বিভাগ': {
    'কুমিল্লা': {
      'name': 'কুমিল্লা',
      'দেবিদ্বার': {'name': 'দেবিদ্বার', 'lat': 23.6115, 'long': 90.9773},
      'বরুড়া': {'name': 'বরুড়া', 'lat': 23.3762, 'long': 91.0556},
      'ব্রাহ্মণপাড়া': {
        'name': 'ব্রাহ্মণপাড়া',
        'lat': 23.6225,
        'long': 91.1017
      },
      'চান্দিনা': {'name': 'চান্দিনা', 'lat': 23.4892, 'long': 91.0084},
      'চৌদ্দগ্রাম': {'name': 'চৌদ্দগ্রাম', 'lat': 23.3058, 'long': 91.2698},
      'দাউদকান্দি': {'name': 'দাউদকান্দি', 'lat': 23.5336, 'long': 90.7245},
      'হোমনা': {'name': 'হোমনা', 'lat': 23.6825, 'long': 90.7833},
      'লাকসাম': {'name': 'লাকসাম', 'lat': 23.2449, 'long': 91.1212},
      'মুরাদনগর': {'name': 'মুরাদনগর', 'lat': 23.7128, 'long': 90.9438},
      'নাঙ্গলকোট': {'name': 'নাঙ্গলকোট', 'lat': 23.1694, 'long': 91.1977},
      'কুমিল্লা সদর': {'name': 'কুমিল্লা সদর', 'lat': 23.4607, 'long': 91.1808},
      'মেঘনা': {'name': 'মেঘনা', 'lat': 23.6248, 'long': 90.701},
      'মনোহরগঞ্জ': {'name': 'মনোহরগঞ্জ', 'lat': 23.1123, 'long': 91.1158},
      'সদর দক্ষিণ': {'name': 'সদর দক্ষিণ', 'lat': 23.4189, 'long': 91.1727},
      'তিতাস': {'name': 'তিতাস', 'lat': 23.6004, 'long': 90.8153},
      'বুড়িচং': {'name': 'বুড়িচং', 'lat': 23.5535, 'long': 91.1267},
      'লালমাই': {'name': 'লালমাই', 'lat': 23.4379, 'long': 91.1257}
    },
    'ফেনী': {
      'name': 'ফেনী',
      'ছাগলনাইয়া উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'ফেনী সদর': {'name': '', 'lat': 1, 'long': 1},
      'সোনাগাজী উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'ফুলগাজী উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'পরশুরাম': {'name': '', 'lat': 1, 'long': 1},
      'দাগনভূঞা': {'name': '', 'lat': 1, 'long': 1}
    },
    'ব্রাহ্মণবাড়িয়া': {
      'name': 'ব্রাহ্মণবাড়িয়া',
      'ব্রাহ্মণবাড়িয়া সদর': {'name': '', 'lat': 1, 'long': 1},
      'কসবা': {'name': '', 'lat': 1, 'long': 1},
      'নাসিরনগর': {'name': '', 'lat': 1, 'long': 1},
      'সরাইল উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'আশুগঞ্জ': {'name': '', 'lat': 1, 'long': 1},
      'আখাউড়া': {'name': '', 'lat': 1, 'long': 1},
      'নবীনগর': {'name': '', 'lat': 1, 'long': 1},
      'বাঞ্ছারামপুর': {'name': '', 'lat': 1, 'long': 1},
      'বিজয়নগর': {'name': '', 'lat': 1, 'long': 1}
    },
    'রাঙ্গামাটি': {
      'name': 'রাঙ্গামাটি',
      'রাঙ্গামাটি সদর': {'name': '', 'lat': 1, 'long': 1},
      'কাপ্তাই': {'name': '', 'lat': 1, 'long': 1},
      'কাউখালী': {'name': '', 'lat': 1, 'long': 1},
      'বাঘাইছড়ি': {'name': '', 'lat': 1, 'long': 1},
      'বরকল': {'name': '', 'lat': 1, 'long': 1},
      'লংগদু': {'name': '', 'lat': 1, 'long': 1},
      'রাজস্থলী': {'name': '', 'lat': 1, 'long': 1},
      'বিলাইছড়ি': {'name': '', 'lat': 1, 'long': 1},
      'জুরাছড়ি': {'name': '', 'lat': 1, 'long': 1},
      'নানিয়ারচর': {'name': '', 'lat': 1, 'long': 1}
    },
    'নোয়াখালী': {
      'name': 'নোয়াখালী',
      'নোয়াখালী': {'name': '', 'lat': 1, 'long': 1},
      'কোম্পানীগঞ্জ': {'name': '', 'lat': 1, 'long': 1},
      'বেগমগঞ্জ': {'name': '', 'lat': 1, 'long': 1},
      'হাতিয়া': {'name': '', 'lat': 1, 'long': 1},
      'সুবর্ণচর': {'name': '', 'lat': 1, 'long': 1},
      'কবিরহাট': {'name': '', 'lat': 1, 'long': 1},
      'সেনবাগ': {'name': '', 'lat': 1, 'long': 1},
      'চাটখিল': {'name': '', 'lat': 1, 'long': 1},
      'সোনাইমুড়ী': {'name': '', 'lat': 1, 'long': 1}
    },
    'চাঁদপুর': {
      'name': 'চাঁদপুর',
      'হাইমচর': {'name': '', 'lat': 1, 'long': 1},
      'কচুয়া': {'name': '', 'lat': 1, 'long': 1},
      'শাহরাস্তি': {'name': '', 'lat': 1, 'long': 1},
      'চাঁদপুর সদর': {'name': '', 'lat': 1, 'long': 1},
      'মতলব': {'name': '', 'lat': 1, 'long': 1},
      'হাজীগঞ্জ': {'name': '', 'lat': 1, 'long': 1},
      'ফরিদগঞ্জ': {'name': '', 'lat': 1, 'long': 1}
    },
    'লক্ষ্মীপুর': {
      'name': 'লক্ষ্মীপুর',
      'লক্ষ্মীপুর সদর': {'name': '', 'lat': 1, 'long': 1},
      'কমলনগর': {'name': '', 'lat': 1, 'long': 1},
      'রায়পুর': {'name': '', 'lat': 1, 'long': 1},
      'রামগতি': {'name': '', 'lat': 1, 'long': 1},
      'রামগঞ্জ': {'name': '', 'lat': 1, 'long': 1}
    },
    'চট্টগ্রাম': {
      'name': 'চট্টগ্রাম',
      'রাঙ্গুনিয়া': {'name': '', 'lat': 1, 'long': 1},
      'সীতাকুন্ড উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'মীরসরাই': {'name': '', 'lat': 1, 'long': 1},
      'পটিয়া': {'name': '', 'lat': 1, 'long': 1},
      'সন্দ্বীপ': {'name': '', 'lat': 1, 'long': 1},
      'বাঁশখালী': {'name': '', 'lat': 1, 'long': 1},
      'বোয়ালখালী': {'name': '', 'lat': 1, 'long': 1},
      'আনোয়ারা': {'name': '', 'lat': 1, 'long': 1},
      'চন্দনাইশ': {'name': '', 'lat': 1, 'long': 1},
      'সাতকানিয়া': {'name': '', 'lat': 1, 'long': 1},
      'লোহাগাড়া': {'name': '', 'lat': 1, 'long': 1},
      'হাটহাজারী': {'name': '', 'lat': 1, 'long': 1},
      'ফটিকছড়ি': {'name': '', 'lat': 1, 'long': 1},
      'রাউজান': {'name': '', 'lat': 1, 'long': 1},
      'কর্ণফুলী': {'name': '', 'lat': 1, 'long': 1}
    },
    'কক্সবাজার': {
      'name': 'কক্সবাজার',
      'কক্সবাজার সদর': {'name': '', 'lat': 1, 'long': 1},
      'চকরিয়া': {'name': '', 'lat': 1, 'long': 1},
      'কুতুবদিয়া': {'name': '', 'lat': 1, 'long': 1},
      'উখিয়া': {'name': '', 'lat': 1, 'long': 1},
      'মহেশখালী': {'name': '', 'lat': 1, 'long': 1},
      'পেকুয়া': {'name': '', 'lat': 1, 'long': 1},
      'রামু': {'name': '', 'lat': 1, 'long': 1},
      'টেকনাফ': {'name': '', 'lat': 1, 'long': 1}
    },
    'খাগড়াছড়ি': {
      'name': 'খাগড়াছড়ি',
      'খাগড়াছড়ি সদর': {'name': '', 'lat': 1, 'long': 1},
      'দিঘীনালা': {'name': '', 'lat': 1, 'long': 1},
      'পানছড়ি': {'name': '', 'lat': 1, 'long': 1},
      'লক্ষীছড়ি': {'name': '', 'lat': 1, 'long': 1},
      'মহালছড়ি': {'name': '', 'lat': 1, 'long': 1},
      'মানিকছড়ি': {'name': '', 'lat': 1, 'long': 1},
      'রামগড়': {'name': '', 'lat': 1, 'long': 1},
      'মাটিরাঙ্গা': {'name': '', 'lat': 1, 'long': 1},
      'গুইমারা': {'name': '', 'lat': 1, 'long': 1}
    },
    'বান্দরবান': {
      'name': 'বান্দরবান',
      'বান্দরবান সদর': {'name': '', 'lat': 1, 'long': 1},
      'আলীকদম': {'name': '', 'lat': 1, 'long': 1},
      'নাইক্ষ্যংছড়ি': {'name': '', 'lat': 1, 'long': 1},
      'রোয়াংছড়ি': {'name': '', 'lat': 1, 'long': 1},
      'লামা': {'name': '', 'lat': 1, 'long': 1},
      'রুমা': {'name': '', 'lat': 1, 'long': 1},
      'থানচি': {'name': '', 'lat': 1, 'long': 1}
    },
    
  },
  'রাজশাহী বিভাগ': {
    'সিরাজগঞ্জ': {
      'name': 'সিরাজগঞ্জ',
      'বেলকুচি': {'name': '', 'lat': 1, 'long': 1},
      'চৌহালি': {'name': '', 'lat': 1, 'long': 1},
      'কামারখন্দ': {'name': '', 'lat': 1, 'long': 1},
      'কাজীপুর': {'name': '', 'lat': 1, 'long': 1},
      'রায়গঞ্জ': {'name': '', 'lat': 1, 'long': 1},
      'শাহজাদপুর': {'name': '', 'lat': 1, 'long': 1},
      'সিরাজগঞ্জ': {'name': '', 'lat': 1, 'long': 1},
      'তাড়াশ': {'name': '', 'lat': 1, 'long': 1},
      'উল্লাপাড়া': {'name': '', 'lat': 1, 'long': 1}
    },
    'পাবনা': {
      'name': 'পাবনা',
      'সুজানগর': {'name': '', 'lat': 1, 'long': 1},
      'ঈশ্বরদী': {'name': '', 'lat': 1, 'long': 1},
      'ভাঙ্গুড়া': {'name': '', 'lat': 1, 'long': 1},
      'পাবনা সদর': {'name': '', 'lat': 1, 'long': 1},
      'বেড়া': {'name': '', 'lat': 1, 'long': 1},
      'আটঘরিয়া': {'name': '', 'lat': 1, 'long': 1},
      'চাটমোহর': {'name': '', 'lat': 1, 'long': 1},
      'সাঁথিয়া': {'name': '', 'lat': 1, 'long': 1},
      'ফরিদপুর': {'name': '', 'lat': 1, 'long': 1}
    },
    'বগুড়া': {
      'name': 'বগুড়া',
      'কাহালু উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'বগুড়া সদর': {'name': '', 'lat': 1, 'long': 1},
      'সারিয়াকান্দি': {'name': '', 'lat': 1, 'long': 1},
      'শাজাহানপুর': {'name': '', 'lat': 1, 'long': 1},
      'দুপচাচিঁয়া উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'আদমদিঘি উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'নন্দিগ্রাম': {'name': '', 'lat': 1, 'long': 1},
      'সোনাতলা উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'ধুনট উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'গাবতলী': {'name': '', 'lat': 1, 'long': 1},
      'শেরপুর উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'শিবগঞ্জ': {'name': '', 'lat': 1, 'long': 1}
    },
    'রাজশাহী': {
      'name': 'রাজশাহী',
      'পবা উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'দুর্গাপুর উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'মোহনপুর উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'চারঘাট উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'পুঠিয়া উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'বাঘা উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'গোদাগাড়ী উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'তানোর উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'বাগমারা উপজেলা': {'name': '', 'lat': 1, 'long': 1}
    },
    'নাটোর': {
      'name': 'নাটোর',
      'নাটোর সদর': {'name': '', 'lat': 1, 'long': 1},
      'সিংড়া': {'name': '', 'lat': 1, 'long': 1},
      'বড়াইগ্রাম': {'name': '', 'lat': 1, 'long': 1},
      'বাগাতিপাড়া': {'name': '', 'lat': 1, 'long': 1},
      'লালপুর': {'name': '', 'lat': 1, 'long': 1},
      'গুরুদাসপুর': {'name': '', 'lat': 1, 'long': 1},
      'নলডাঙ্গা': {'name': '', 'lat': 1, 'long': 1}
    },
    'জয়পুরহাট': {
      'name': 'জয়পুরহাট',
      'আক্কেলপুর উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'কালাই উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'ক্ষেতলাল উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'পাঁচবিবি উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'জয়পুরহাট সদর': {'name': '', 'lat': 1, 'long': 1}
    },
    'চাঁপাইনবাবগঞ্জ': {
      'name': 'চাঁপাইনবাবগঞ্জ',
      'চাঁপাইনবাবগঞ্জ সদর': {'name': '', 'lat': 1, 'long': 1},
      'গোমস্তাপুর': {'name': '', 'lat': 1, 'long': 1},
      'নাচোল': {'name': '', 'lat': 1, 'long': 1},
      'ভোলাহাট': {'name': '', 'lat': 1, 'long': 1},
      'শিবগঞ্জ': {'name': '', 'lat': 1, 'long': 1}
    },
    'নওগাঁ': {
      'name': 'নওগাঁ',
      'মহাদেবপুর উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'বদলগাছী উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'পত্নিতলা উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'ধামইরহাট উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'নিয়ামতপুর উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'মান্দা উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'আত্রাই উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'রাণীনগর উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'নওগাঁ সদর': {'name': '', 'lat': 1, 'long': 1},
      'পোরশা উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'সাপাহার': {'name': '', 'lat': 1, 'long': 1}
    },
  },
  'খুলনা বিভাগ': {
    'যশোর': {
      'name': 'যশোর',
      'মণিরামপুর': {'name': '', 'lat': 1, 'long': 1},
      'অভয়নগর': {'name': '', 'lat': 1, 'long': 1},
      'বাঘারপাড়া': {'name': '', 'lat': 1, 'long': 1},
      'চৌগাছা': {'name': '', 'lat': 1, 'long': 1},
      'ঝিকরগাছা': {'name': '', 'lat': 1, 'long': 1},
      'কেশবপুর': {'name': '', 'lat': 1, 'long': 1},
      'যশোর সদর': {'name': '', 'lat': 1, 'long': 1},
      'শার্শা': {'name': '', 'lat': 1, 'long': 1}
    },
    'সাতক্ষীরা': {
      'name': 'সাতক্ষীরা',
      'আশাশুনি': {'name': '', 'lat': 1, 'long': 1},
      'দেবহাটা': {'name': '', 'lat': 1, 'long': 1},
      'কলারোয়া': {'name': '', 'lat': 1, 'long': 1},
      'সাতক্ষীরা সদর': {'name': '', 'lat': 1, 'long': 1},
      'শ্যামনগর': {'name': '', 'lat': 1, 'long': 1},
      'তালা': {'name': '', 'lat': 1, 'long': 1},
      'কালিগঞ্জ': {'name': '', 'lat': 1, 'long': 1}
    },
    'মেহেরপুর': {
      'name': 'মেহেরপুর',
      'মুজিবনগর': {'name': '', 'lat': 1, 'long': 1},
      'মেহেরপুর সদর': {'name': '', 'lat': 1, 'long': 1},
      'গাংনী': {'name': '', 'lat': 1, 'long': 1}
    },
    'নড়াইল': {'name': 'নড়াইল', 'নড়াইল সদর': {}, 'লোহাগড়া': {}, 'কালিয়া': {}},
    'চুয়াডাঙ্গা': {
      'name': 'চুয়াডাঙ্গা',
      'চুয়াডাঙ্গা সদর': {'name': '', 'lat': 1, 'long': 1},
      'আলমডাঙ্গা': {'name': '', 'lat': 1, 'long': 1},
      'দামুড়হুদা': {'name': '', 'lat': 1, 'long': 1},
      'জীবননগর': {'name': '', 'lat': 1, 'long': 1}
    },
    'কুষ্টিয়া': {
      'name': 'কুষ্টিয়া',
      'কুষ্টিয়া সদর': {'name': '', 'lat': 1, 'long': 1},
      'কুমারখালী': {'name': '', 'lat': 1, 'long': 1},
      'খোকসা': {'name': '', 'lat': 1, 'long': 1},
      'মিরপুর': {'name': '', 'lat': 1, 'long': 1},
      'দৌলতপুর': {'name': '', 'lat': 1, 'long': 1},
      'ভেড়ামারা': {'name': '', 'lat': 1, 'long': 1}
    },
    'মাগুরা': {
      'name': 'মাগুরা',
      'শালিখা': {'name': '', 'lat': 1, 'long': 1},
      'শ্রীপুর': {'name': '', 'lat': 1, 'long': 1},
      'মাগুরা সদর': {'name': '', 'lat': 1, 'long': 1},
      'মহম্মদপুর': {'name': '', 'lat': 1, 'long': 1}
    },
    'খুলনা': {
      'name': 'খুলনা',
      'পাইকগাছা': {'name': '', 'lat': 1, 'long': 1},
      'ফুলতলা উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'দিঘলিয়া উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'রূপসা উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'তেরখাদা উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'ডুমুরিয়া উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'বটিয়াঘাটা': {'name': '', 'lat': 1, 'long': 1},
      'দাকোপ উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'কয়রা উপজেলা': {'name': '', 'lat': 1, 'long': 1}
    },
    'বাগেরহাট': {
      'name': 'বাগেরহাট',
      'ফকিরহাট': {'name': '', 'lat': 1, 'long': 1},
      'বাগেরহাট সদর': {'name': '', 'lat': 1, 'long': 1},
      'মোল্লাহাট': {'name': '', 'lat': 1, 'long': 1},
      'শরণখোলা': {'name': '', 'lat': 1, 'long': 1},
      'রামপাল': {'name': '', 'lat': 1, 'long': 1},
      'মোড়েলগঞ্জ': {'name': '', 'lat': 1, 'long': 1},
      'কচুয়া': {'name': '', 'lat': 1, 'long': 1},
      'মোংলা': {'name': '', 'lat': 1, 'long': 1},
      'চিতলমারী': {'name': '', 'lat': 1, 'long': 1}
    },
    'ঝিনাইদহ': {
      'name': 'ঝিনাইদহ',
      'ঝিনাইদহ সদর': {'name': '', 'lat': 1, 'long': 1},
      'শৈলকুপা': {'name': '', 'lat': 1, 'long': 1},
      'হরিণাকুন্ডু': {'name': '', 'lat': 1, 'long': 1},
      'কালীগঞ্জ': {'name': '', 'lat': 1, 'long': 1},
      'কোটচাঁদপুর': {'name': '', 'lat': 1, 'long': 1},
      'মহেশপুর': {'name': '', 'lat': 1, 'long': 1}
    },
  },
  'বরিশাল বিভাগ': {
    'ঝালকাঠি': {
      'name': 'ঝালকাঠি',
      'ঝালকাঠি সদর': {'name': '', 'lat': 1, 'long': 1},
      'কাঠালিয়া': {'name': '', 'lat': 1, 'long': 1},
      'নলছিটি': {'name': '', 'lat': 1, 'long': 1},
      'রাজাপুর': {'name': '', 'lat': 1, 'long': 1}
    },
    'পটুয়াখালী': {
      'name': 'পটুয়াখালী',
      'বাউফল': {'name': '', 'lat': 1, 'long': 1},
      'পটুয়াখালী সদর': {'name': '', 'lat': 1, 'long': 1},
      'দুমকি': {'name': '', 'lat': 1, 'long': 1},
      'দশমিনা': {'name': '', 'lat': 1, 'long': 1},
      'কলাপাড়া': {'name': '', 'lat': 1, 'long': 1},
      'মির্জাগঞ্জ': {'name': '', 'lat': 1, 'long': 1},
      'গলাচিপা': {'name': '', 'lat': 1, 'long': 1},
      'রাঙ্গাবালী': {'name': '', 'lat': 1, 'long': 1}
    },
    'পিরোজপুর': {
      'name': 'পিরোজপুর',
      'পিরোজপুর সদর': {'name': '', 'lat': 1, 'long': 1},
      'নাজিরপুর': {'name': '', 'lat': 1, 'long': 1},
      'কাউখালী': {'name': '', 'lat': 1, 'long': 1},
      'ভান্ডারিয়া': {'name': '', 'lat': 1, 'long': 1},
      'মঠবাড়ীয়া': {'name': '', 'lat': 1, 'long': 1},
      'নেছারাবাদ': {'name': '', 'lat': 1, 'long': 1},
      'ইন্দুরকানী': {'name': '', 'lat': 1, 'long': 1}
    },
    'বরিশাল': {
      'name': 'বরিশাল',
      'বরিশাল সদর': {'name': '', 'lat': 1, 'long': 1},
      'বাকেরগঞ্জ': {'name': '', 'lat': 1, 'long': 1},
      'বাবুগঞ্জ': {'name': '', 'lat': 1, 'long': 1},
      'উজিরপুর': {'name': '', 'lat': 1, 'long': 1},
      'বানারীপাড়া': {'name': '', 'lat': 1, 'long': 1},
      'গৌরনদী': {'name': '', 'lat': 1, 'long': 1},
      'আগৈলঝাড়া': {'name': '', 'lat': 1, 'long': 1},
      'মেহেন্দিগঞ্জ': {'name': '', 'lat': 1, 'long': 1},
      'মুলাদী': {'name': '', 'lat': 1, 'long': 1},
      'হিজলা': {'name': '', 'lat': 1, 'long': 1}
    },
    'ভোলা': {
      'name': 'ভোলা',
      'ভোলা সদর': {'name': '', 'lat': 1, 'long': 1},
      'বোরহান উদ্দিন': {'name': '', 'lat': 1, 'long': 1},
      'চরফ্যাশন': {'name': '', 'lat': 1, 'long': 1},
      'দৌলতখান': {'name': '', 'lat': 1, 'long': 1},
      'মনপুরা': {'name': '', 'lat': 1, 'long': 1},
      'তজুমদ্দিন': {'name': '', 'lat': 1, 'long': 1},
      'লালমোহন': {'name': '', 'lat': 1, 'long': 1}
    },
    'বরগুনা': {
      'name': 'বরগুনা',
      'আমতলী': {'name': '', 'lat': 1, 'long': 1},
      'বরগুনা সদর': {'name': '', 'lat': 1, 'long': 1},
      'বেতাগী উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'বামনা': {'name': '', 'lat': 1, 'long': 1},
      'পাথরঘাটা': {'name': '', 'lat': 1, 'long': 1},
      'তালতলি': {'name': '', 'lat': 1, 'long': 1}
    },
  },
  'সিলেট বিভাগ': {
    'সিলেট': {
      'name': 'সিলেট',
      'বালাগঞ্জ': {'name': '', 'lat': 1, 'long': 1},
      'বিয়ানীবাজার': {'name': '', 'lat': 1, 'long': 1},
      'বিশ্বনাথ': {'name': '', 'lat': 1, 'long': 1},
      'কোম্পানীগঞ্জ': {'name': '', 'lat': 1, 'long': 1},
      'ফেঞ্চুগঞ্জ': {'name': '', 'lat': 1, 'long': 1},
      'গোলাপগঞ্জ': {'name': '', 'lat': 1, 'long': 1},
      'গোয়াইনঘাট': {'name': '', 'lat': 1, 'long': 1},
      'জৈন্তাপুর': {'name': '', 'lat': 1, 'long': 1},
      'কানাইঘাট': {'name': '', 'lat': 1, 'long': 1},
      'সিলেট সদর': {'name': '', 'lat': 1, 'long': 1},
      'জকিগঞ্জ': {'name': '', 'lat': 1, 'long': 1},
      'দক্ষিণ সুরমা': {'name': '', 'lat': 1, 'long': 1},
      'ওসমানী': {'name': '', 'lat': 1, 'long': 1}
    },
    'মৌলভীবাজার': {
      'name': 'মৌলভীবাজার',
      'বড়লেখা': {'name': '', 'lat': 1, 'long': 1},
      'কমলগঞ্জ': {'name': '', 'lat': 1, 'long': 1},
      'কুলাউড়া': {'name': '', 'lat': 1, 'long': 1},
      'মৌলভীবাজার সদর': {'name': '', 'lat': 1, 'long': 1},
      'রাজনগর': {'name': '', 'lat': 1, 'long': 1},
      'শ্রীমঙ্গল': {'name': '', 'lat': 1, 'long': 1},
      'জুড়ী': {'name': '', 'lat': 1, 'long': 1}
    },
    'হবিগঞ্জ': {
      'name': 'হবিগঞ্জ',
      'নবীগঞ্জ': {'name': '', 'lat': 1, 'long': 1},
      'বাহুবল': {'name': '', 'lat': 1, 'long': 1},
      'আজমিরীগঞ্জ': {'name': '', 'lat': 1, 'long': 1},
      'বানিয়াচং': {'name': '', 'lat': 1, 'long': 1},
      'লাখাই': {'name': '', 'lat': 1, 'long': 1},
      'চুনারুঘাট': {'name': '', 'lat': 1, 'long': 1},
      'হবিগঞ্জ সদর': {'name': '', 'lat': 1, 'long': 1},
      'মাধবপুর উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'শায়েস্তাগঞ্জ': {'name': '', 'lat': 1, 'long': 1}
    },
    'সুনামগঞ্জ': {
      'name': 'সুনামগঞ্জ',
      'সুনামগঞ্জ সদর': {'name': '', 'lat': 1, 'long': 1},
      'দক্ষিণ সুনামগঞ্জ': {'name': '', 'lat': 1, 'long': 1},
      'বিশ্বম্ভরপুর': {'name': '', 'lat': 1, 'long': 1},
      'ছাতক': {'name': '', 'lat': 1, 'long': 1},
      'জগন্নাথপুর': {'name': '', 'lat': 1, 'long': 1},
      'দোয়ারাবাজার': {'name': '', 'lat': 1, 'long': 1},
      'তাহিরপুর': {'name': '', 'lat': 1, 'long': 1},
      'ধর্মপাশা': {'name': '', 'lat': 1, 'long': 1},
      'জামালগঞ্জ': {'name': '', 'lat': 1, 'long': 1},
      'শাল্লা': {'name': '', 'lat': 1, 'long': 1},
      'দিরাই': {'name': '', 'lat': 1, 'long': 1}
    },
  },
  'ঢাকা বিভাগ': {
    'নরসিংদী': {
      'name': 'নরসিংদী',
      'বেলাবো': {'name': '', 'lat': 1, 'long': 1},
      'মনোহরদী': {'name': '', 'lat': 1, 'long': 1},
      'নরসিংদী': {'name': '', 'lat': 1, 'long': 1},
      'পলাশ': {'name': '', 'lat': 1, 'long': 1},
      'রায়পুরা': {'name': '', 'lat': 1, 'long': 1},
      'শিবপুর': {'name': '', 'lat': 1, 'long': 1}
    },
    'গাজীপুর': {
      'name': 'গাজীপুর',
      'কালীগঞ্জ': {'name': '', 'lat': 1, 'long': 1},
      'কালিয়াকৈর': {'name': '', 'lat': 1, 'long': 1},
      'কাপাসিয়া': {'name': '', 'lat': 1, 'long': 1},
      'গাজীপুর সদর': {'name': '', 'lat': 1, 'long': 1},
      'শ্রীপুর': {'name': '', 'lat': 1, 'long': 1}
    },
    'শরীয়তপুর': {
      'name': 'শরীয়তপুর',
      'শরিয়তপুর সদর': {'name': '', 'lat': 1, 'long': 1},
      'নড়িয়া': {'name': '', 'lat': 1, 'long': 1},
      'জাজিরা': {'name': '', 'lat': 1, 'long': 1},
      'গোসাইরহাট': {'name': '', 'lat': 1, 'long': 1},
      'ভেদরগঞ্জ': {'name': '', 'lat': 1, 'long': 1},
      'ডামুড্যা': {'name': '', 'lat': 1, 'long': 1}
    },
    'নারায়ণগঞ্জ': {
      'name': 'নারায়ণগঞ্জ',
      'আড়াইহাজার উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'বন্দর উপজেলা': {'name': '', 'lat': 1, 'long': 1},
      'নারায়নগঞ্জ সদর': {'name': '', 'lat': 1, 'long': 1},
      'রূপগঞ্জ উপজেলা': {},
      'সোনারগাঁ উপজেলা': {}
    },
    'টাঙ্গাইল': {
      'name': 'টাঙ্গাইল',
      'বাসাইল': {},
      'ভুয়াপুর': {},
      'দেলদুয়ার': {},
      'ঘাটাইল': {},
      'গোপালপুর': {},
      'মধুপুর': {},
      'মির্জাপুর': {},
      'নাগরপুর': {},
      'সখিপুর': {},
      'টাঙ্গাইল সদর': {},
      'কালিহাতী': {},
      'ধনবাড়ী': {}
    },
    'কিশোরগঞ্জ': {
      'name': 'কিশোরগঞ্জ',
      'ইটনা': {},
      'কটিয়াদী': {},
      'ভৈরব': {},
      'তাড়াইল': {},
      'হোসেনপুর': {},
      'পাকুন্দিয়া': {},
      'কুলিয়ারচর': {},
      'কিশোরগঞ্জ সদর': {},
      'করিমগঞ্জ': {},
      'বাজিতপুর': {},
      'অষ্টগ্রাম': {},
      'মিঠামইন': {},
      'নিকলী': {}
    },
    'মানিকগঞ্জ': {
      'name': 'মানিকগঞ্জ',
      'হরিরামপুর': {},
      'সাটুরিয়া': {},
      'মানিকগঞ্জ সদর': {},
      'ঘিওর': {},
      'শিবালয়': {},
      'দৌলতপুর': {},
      'সিংগাইর': {}
    },
    'ঢাকা': {
      'name': 'ঢাকা',
      'সাভার': {},
      'ধামরাই': {},
      'কেরাণীগঞ্জ': {},
      'নবাবগঞ্জ': {},
      'দোহার': {}
    },
    'মুন্সিগঞ্জ': {
      'name': 'মুন্সিগঞ্জ',
      'মুন্সিগঞ্জ সদর': {},
      'শ্রীনগর': {},
      'সিরাজদিখান': {},
      'লৌহজং': {},
      'গজারিয়া': {},
      'টংগীবাড়ি': {}
    },
    'রাজবাড়ী': {
      'name': 'রাজবাড়ী',
      'রাজবাড়ী সদর': {},
      'গোয়ালন্দ': {},
      'পাংশা': {},
      'বালিয়াকান্দি': {},
      'কালুখালী': {}
    },
    'মাদারীপুর': {
      'name': 'মাদারীপুর',
      'মাদারীপুর সদর': {},
      'শিবচর': {},
      'কালকিনি': {},
      'রাজৈর': {}
    },
    'গোপালগঞ্জ': {
      'name': 'গোপালগঞ্জ',
      'গোপালগঞ্জ সদর': {},
      'কাশিয়ানী': {},
      'টুংগীপাড়া': {},
      'কোটালীপাড়া': {},
      'মুকসুদপুর': {}
    },
    'ফরিদপুর': {
      'name': 'ফরিদপুর',
      'ফরিদপুর সদর': {},
      'আলফাডাঙ্গা': {},
      'বোয়ালমারী': {},
      'সদরপুর': {},
      'নগরকান্দা': {},
      'ভাঙ্গা': {},
      'চরভদ্রাসন': {},
      'মধুখালী': {},
      'সালথা': {}
    },
  },
  'রংপুর বিভাগ': {
    'পঞ্চগড়': {
      'name': 'পঞ্চগড়',
      'পঞ্চগড়': {},
      'দেবীগঞ্জ': {},
      'বোদা': {},
      'আটোয়ারী': {},
      'তেতুলিয়া': {}
    },
    'দিনাজপুর': {
      'name': 'দিনাজপুর',
      'নবাবগঞ্জ': {},
      'বীরগঞ্জ উপজেলা': {},
      'ঘোড়াঘাট': {},
      'বিরামপুর': {},
      'পার্বতীপুর উপজেলা': {},
      'বোচাগঞ্জ উপজেলা': {},
      'কাহারোল উপজেলা': {},
      'ফুলবাড়ী উপজেলা': {},
      'দিনাজপুর সদর': {},
      'হাকিমপুর উপজেলা': {},
      'খানসামা': {},
      'বিরল উপজেলা': {},
      'চিরিরবন্দর উপজেলা': {}
    },
    'লালমনিরহাট': {
      'name': 'লালমনিরহাট',
      'লালমনিরহাট সদর': {},
      'কালীগঞ্জ': {},
      'হাতীবান্ধা': {},
      'পাটগ্রাম': {},
      'আদিতমারী উপজেলা': {}
    },
    'নীলফামারী': {
      'name': 'নীলফামারী',
      'সৈয়দপুর উপজেলা': {},
      'ডোমার উপজেলা': {},
      'ডিমলা': {},
      'জলঢাকা': {},
      'কিশোরগঞ্জ': {},
      'নীলফামারী সদর': {}
    },
    'গাইবান্ধা': {
      'name': 'গাইবান্ধা',
      'সাদুল্লাপুর': {},
      'গাইবান্ধা সদর': {},
      'পলাশবাড়ী': {},
      'সাঘাটা উপজেলা': {},
      'গোবিন্দগঞ্জ উপজেলা': {},
      'সুন্দরগঞ্জ': {},
      'ফুলছড়ি': {}
    },
    'ঠাকুরগাঁও': {
      'name': 'ঠাকুরগাঁও',
      'ঠাকুরগাঁও সদর': {},
      'পীরগঞ্জ উপজেলা': {},
      'রাণীশংকৈল উপজেলা': {},
      'হরিপুর উপজেলা': {},
      'বালিয়াডাঙ্গী উপজেলা': {}
    },
    'রংপুর': {
      'name': 'রংপুর',
      'রংপুর সদর': {},
      'গংগাচড়া': {},
      'তারাগঞ্জ উপজেলা': {},
      'বদরগঞ্জ উপজেলা': {},
      'মিঠাপুকুর উপজেলা': {},
      'পীরগঞ্জ উপজেলা': {},
      'কাউনিয়া উপজেলা': {},
      'পীরগাছা উপজেলা': {}
    },
    'কুড়িগ্রাম': {
      'name': 'কুড়িগ্রাম',
      'কুড়িগ্রাম সদর': {},
      'নাগেশ্বরী': {},
      'ভুরুঙ্গামারী': {},
      'ফুলবাড়ী': {},
      'রাজারহাট': {},
      'উলিপুর': {},
      'চিলমারী': {},
      'রৌমারী': {},
      'চর রাজিবপুর': {}
    },
  },
  'ময়মনসিংহ বিভাগ': {
    'শেরপুর': {
      'name': 'শেরপুর',
      'শেরপুর সদর': {},
      'নালিতাবাড়ী উপজেলা': {},
      'শ্রীবরদী উপজেলা': {},
      'নকলা উপজেলা': {},
      'ঝিনাইগাতী উপজেলা': {}
    },
    'ময়মনসিংহ': {
      'name': 'ময়মনসিংহ',
      'ফুলবাড়ীয়া': {},
      'ত্রিশাল': {},
      'ভালুকা': {},
      'মুক্তাগাছা': {},
      'ময়মনসিংহ সদর': {},
      'ধোবাউড়া': {},
      'ফুলপুর': {},
      'হালুয়াঘাট': {},
      'গৌরীপুর': {},
      'গফরগাঁও': {},
      'ঈশ্বরগঞ্জ': {},
      'নান্দাইল': {},
      'তারাকান্দা': {}
    },
    'জামালপুর': {
      'name': 'জামালপুর',
      'জামালপুর সদর': {},
      'মেলান্দহ': {},
      'ইসলামপুর': {},
      'দেওয়ানগঞ্জ': {},
      'সরিষাবাড়ী': {},
      'মাদারগঞ্জ': {},
      'বকশীগঞ্জ': {}
    },
    'নেত্রকোণা': {
      'name': 'নেত্রকোণা',
      'বারহাট্টা': {},
      'দুর্গাপুর': {},
      'কেন্দুয়া': {},
      'আটপাড়া': {},
      'মদন': {},
      'খালিয়াজুরী': {},
      'কলমাকান্দা': {},
      'মোহনগঞ্জ': {},
      'পূর্বধলা': {},
      'নেত্রকোণা সদর': {}
    },
  }
}